export const aboutUserInf = {
  description: [
    "Мой путь в изучении front-end разработки начался в 2023 году, когда приняла решение кардинально сменить профессию. До этого, около 20 лет работала в экономической сфере (бухгалтерия), 9 лет из которых на руководящей должности. Со временем моё внимание привлекла web-разработка, и я начала осваивать новую сферу с нуля.",
    "Обучалась самостоятельно, с акцентом на практическое применение знаний. Все мои проекты проходили проверку и получили одобрение от ментора — сеньор front-end разработчика, что позволило получить ценную обратную связь и значительно улучшить навыки.",
  ],

  skills: {
    frameworks: ["React", "Redux Toolkit", "Formik", "React Router"],
    builders: ["Vite"],
    programLang: ["JavaScript"],
    styles: [
      "CSS Modules",
      "Flexbox",
      "Grid",
      "SASS",
      "адаптивная верстка",
      "поддержка светлой/тёмной тем",
    ],
    authHosting: ["Firebase Auth", "Vercel", "Render"],
    addSkills: [
      "date-fns",
      "i18next",
      "storybook",
      "Node.js",
      "Express",
      "REST API",
      "MongoDB",
      "Firebase",
      "fs",
      "Axios",
      "Electron.js",
      "localStorage",
      "github",
    ],
  },

  experience: [
    "Разработку full-stack приложений с продуманной логикой, таких как таймер для отслеживания повторяющихся задач и календарь с возможностью создания событий, авторизацией через Google.",
    "Создание SPA и мультистраничных приложений для практических задач, таких как онлайн-магазин и поиск стран с фильтрами.",
    "Применение Redux для эффективного управления состоянием и обеспечения стабильной работы интерфейса.",
    "Интеграцию внешних API при разработке таких проектов, как погодный виджет и приложения с фильтрацией и темами, работающие с реальными данными.",
  ],
  target:
    "В настоящее время нахожусь в поиске позиции, которая позволит применить и углубить полученные знания. Ориентирована на результат, ответственно подхожу к выполнению задач, стремлюсь к постоянному развитию и освоению новых технологий. Обладаю высоким уровнем самоорганизации, внимательностью к деталям и практическим опытом достижения поставленных целей.",
  addInfo: [
    "В разделе «Mou проекты» представлены примеры моих работ, которые, на текущем этапе, я считаю наиболее интересными и показательными. Каждый проект размещён в открытом доступе и с ним можно ознакомиться по ссылке, указанной в карточке каждого проекта. Также доступны репозитории на GitHub, где можно ознакомиться с архитектурой и структурой кода.",
  ],
};
