{
  "menu": {
    "home": "Главная",
    "about": "Обо мне",
    "projects": "Мои проекты",
    "contacts": "Контакты"
  },

  "user": {
    "name": "Евгения Дьякова"
  },

  "projectNav": {
    "navigation": ["Предыдущий", "Следующий"]
  },

  "aboutUserInf": {
    "sectionTitles": [
      "Информация обо мне",
      "Во время обучения применяла следующие технологии: ",
      "Фреймворки и библиотеки",
      "Инструменты для сборки",
      "Язык программирования",
      "Стилизация",
      "Аутентификация и хостинг",
      "Дополнительные технологии",
      "Мой опыт включает: "
    ],
    "description": [
      "Мой путь в изучении front-end разработки начался в 2023 году, когда приняла решение кардинально сменить профессию. До этого, около 20 лет работала в экономической сфере (бухгалтерия), 9 лет из которых на руководящей должности. Со временем моё внимание привлекла web-разработка, и я начала осваивать новую сферу с нуля.",
      "Обучалась самостоятельно, с акцентом на практическое применение знаний. Все мои проекты проходили проверку и получили одобрение от ментора — сеньор front-end разработчика, что позволило получить ценную обратную связь и значительно улучшить навыки."
    ],

    "skills": {
      "frameworks": ["React", "Redux Toolkit", "Formik", "React Router"],
      "builders": ["Vite"],
      "programLang": ["JavaScript"],
      "styles": [
        "CSS Modules",
        "Flexbox",
        "Grid",
        "SASS",
        "адаптивная верстка",
        "поддержка светлой/тёмной тем"
      ],
      "authHosting": ["Firebase Auth", "Vercel", "Render"],
      "addSkills": [
        "date-fns",
        "i18next",
        "storybook",
        "Node.js",
        "Express",
        "REST API",
        "MongoDB",
        "Firebase",
        "fs",
        "Axios",
        "Electron.js",
        "localStorage",
        "github"
      ]
    },

    "experience": [
      "Разработку full-stack приложений с продуманной логикой, таких как таймер для отслеживания повторяющихся задач и календарь с возможностью создания событий, авторизацией через Google.",
      "Создание SPA и мультистраничных приложений для практических задач, таких как онлайн-магазин и поиск стран с фильтрами.",
      "Применение Redux для эффективного управления состоянием и обеспечения стабильной работы интерфейса.",
      "Интеграцию внешних API при разработке таких проектов, как погодный виджет и приложения с фильтрацией и темами, работающие с реальными данными."
    ],
    "target": "В настоящее время нахожусь в поиске позиции, которая позволит применить и углубить полученные знания. Ориентирована на результат, ответственно подхожу к выполнению задач, стремлюсь к постоянному развитию и освоению новых технологий. Обладаю высоким уровнем самоорганизации, внимательностью к деталям и практическим опытом достижения поставленных целей.",
    "addInfo": "В разделе <projectLink>Mou проекты</projectLink> представлены примеры моих работ, которые, на текущем этапе, я считаю наиболее интересными и показательными. Каждый проект размещён в открытом доступе и с ним можно ознакомиться по ссылке, указанной в карточке каждого проекта. Также доступны репозитории на GitHub, где можно ознакомиться с архитектурой и структурой кода."
  },

  "projectPageInf": {
    "titles": "Mои проекты"
  },

  "projectDetailsInf": {
    "links": ["Посетить сайт", "GitHub репозиторий"]
  },

  "contactInf": {
    "title": "Контактная информация",
    "postcardTitle": "Отправь мне сообщение",
    "placeholders": ["Ваше имя", "Адрес электронной почты", "Сообщение"],
    "btnName": "Отправить сообщение",
    "inputErrors": [
      "Введите имя",
      "Введите адрес электронной почты",
      "Некорректный адрес электронной почты",
      "Введите сообщение"
    ]
  },

  "projectData": {
    "timerApp": {
      "id": "timerApp",
      "title": "Приложение Таймер (React, Node.js)",
      "description": "Это full-stack приложение, позволяющее создавать основной таймер обратного отсчёта и несколько связанных подтаймеров, что идеально подходит для управления повторяющимися задачами, такими как циклы работы и отдыха. Функционал включает настраиваемые таймеры, звуковые уведомления (с возможностью отключения), анимированные визуальные подсказки и полный контроль над созданием, редактированием, удалением и выбором таймеров. Приложение доступно в двух форматах: веб-приложение (онлайн) и настольное приложение (с установкой на компьютер).",
      "technologies": [
        "React + Vite",
        "JavaScript",
        "Module.CSS",
        "Node.js",
        "Express",
        "File system (fs) for data storage",
        "JSON-based REST API",
        "electron.js (for desktop app)"
      ],
      "website": "https://timer-app-nine-neon.vercel.app",
      "github": [
        "https://github.com/JaynDy/Timer_App.git",
        "https://github.com/JaynDy/Timer_App_Server.git"
      ]
    },
    "calendar": {
      "id": "calendar",
      "title": "Календарь (React, Node.js)",
      "description": "Это full-stack приложение для планирования времени с учётом различных типов событий. Пользователи могут авторизоваться через Google. Доступны режимы отображения «Неделя» и «День». В разделе календаря используется календарь по умолчанию, с возможностью изменить его цвет или создать новый. Для добавления события заполняется форма с валидацией, включая поля для времени начала, окончания и повторения. Повторяющиеся события сохраняются как группа, которую можно редактировать или удалять. Все события отображаются в таблице, занимая ячейки в зависимости от времени.",
      "technologies": [
        "React + Vite",
        "JavaScript",
        "Module.CSS",
        "Redux",
        "Axios",
        "Firebase authentication",
        "Node.js",
        "ExpressJS",
        "MongoDB",
        "Vercel",
        "Render"
      ],
      "website": "https://calendar-ivory-eight.vercel.app",
      "github": [
        "https://github.com/JaynDy/Calendar.git",
        "https://github.com/JaynDy/Calendar_Server.git"
      ]
    },
    "onlineShopReact": {
      "id": "onlineShopReact",
      "title": "Интернет-магазин (React)",
      "description": "Это одностраничное приложение с маршрутизацией, предназначенное для управления корзиной и оформления заказов. Пользователь заполняет две формы с валидацией (formik), при этом каждый шаг доступен только после заполнения обязательных полей. Данные сохраняются при возврате к предыдущим шагам. После завершения оформления заказа отображается итоговая карточка, а корзина и данные форм очищаются.",
      "technologies": [
        "React + Vite",
        "JavaScript",
        "Module.CSS",
        "Redux",
        "Formik",
        "Vercel"
      ],
      "website": "https://online-shop-react-2xua.vercel.app",
      "github": ["https://github.com/JaynDy/Online-shop-react.git"]
    },
    "ticTacToe": {
      "id": "ticTacToe",
      "title": "Крестики-нолики (React)",
      "description": "Управление состоянием реализовано с использованием Redux Toolkit. Каждый раунд сопровождается сообщениями с результатами игры. Право первого хода получает победитель. В случае ничьей право хода остаётся за предыдущим победителем. Игроки могут обмениваться сообщениями в чате, который обновляется после нажатия кнопки «Сброс».",
      "technologies": [
        "React + Vite",
        "Module.CSS",
        "JavaScript",
        "Redux",
        "Flexible design",
        "Vercel"
      ],
      "website": "https://tic-tac-toe-one-xi-86.vercel.app",
      "github": ["https://github.com/JaynDy/tic_tac_toe.git"]
    },
    "onlineShop": {
      "id": "onlineShop",
      "title": "Интернет-магазин (Vanilla JS)",
      "description": "Это многостраничное приложение с адаптивным дизайном. Для удобства пользователя реализованы фильтры для поиска нужных товаров и шкала цен. Пользователь может добавлять, редактировать и удалять товары из корзины. Данные корзины сохраняются в local storage.",
      "technologies": [
        "HTML",
        "CSS",
        "Grid",
        "Flexbox",
        "JavaScript",
        "Local storage",
        "Vercel"
      ],
      "website": "https://online-shop-app-nine.vercel.app/mainPage.html",
      "github": ["https://github.com/JaynDy/OnlineShop_App.git"]
    },
    "countriesApp": {
      "id": "countriesApp",
      "title": "Приложение «Страны» (Vanilla JS)",
      "description": "Приложение имеет адаптивную вёрстку с медиа-запросами и использует Flexbox для гибкого расположения карточек стран. JavaScript (ES6+) применяется для поиска стран, фильтрации по регионам и переключения между светлой и тёмной темами.",
      "technologies": ["HTML", "CSS", "Flexbox", "JavaScript", "API", "Vercel"],
      "website": "https://countries-app-zeta-two.vercel.app",
      "github": ["https://github.com/JaynDy/Countries_App.git"]
    },
    "weatherWidget": {
      "id": "weatherWidget",
      "title": "Виджет погоды (Vanilla JS)",
      "description": "Простой виджет погоды, который отображает текущие погодные условия для указанного местоположения. Получает данные с погодного API и показывает температуру, влажность и описание погоды.",
      "technologies": ["HTML", "CSS", "JavaScript", "API", "Vercel"],
      "website": "https://weather-widget-pink-five.vercel.app",
      "github": ["https://github.com/JaynDy/WeatherWidget.git"]
    }
  }
}
